# Pandas DataFrame

# Pandas DataFrame is 2-D, size mutable, Heterogeneous with labeled axes(Rows & Columns)

In Part we are going to see pandas functions.

1. Pandas DataFrame
2. Pandas Series
3. Pandas Basic operations (indexing)

To install pandas 

! pip intall pandas

In [1]:
import pandas as pd

data = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\covid_toy.csv")
data.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

# To Create Dataframe

In [2]:
Data = {
        "Name":[ "Ashu", "Krishna", "Shashank", "Manooj","Karishma", "Kripalu"],
        "Age": [23,24,25,26,27,28],
        "Class": [4,5,6,7,8,9],
        "Place": ["Ratlam", "Ujjain", "Mandsaur", "Bhaugarah", "Morkheda", "Jaipur"],
        "Poket Money": [500,1000,100,200,150,20],
        "vehical": ["mercedes","lamborghini", "Cycle", "Scooty", "Bus", "CTX100"]
}

Data

{'Name': ['Ashu', 'Krishna', 'Shashank', 'Manooj', 'Karishma', 'Kripalu'],
 'Age': [23, 24, 25, 26, 27, 28],
 'Class': [4, 5, 6, 7, 8, 9],
 'Place': ['Ratlam', 'Ujjain', 'Mandsaur', 'Bhaugarah', 'Morkheda', 'Jaipur'],
 'Poket Money': [500, 1000, 100, 200, 150, 20],
 'vehical': ['mercedes', 'lamborghini', 'Cycle', 'Scooty', 'Bus', 'CTX100']}

In [30]:
df = pd.DataFrame(Data ,index =["1","2","3","4","5","6"])
df

       Name  Age  Class      Place  Poket Money      vehical
1      Ashu   23      4     Ratlam          500     mercedes
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus
6   Kripalu   28      9     Jaipur           20       CTX100

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

       Name  Age  Class      Place  Poket Money      vehical
1      Ashu   23      4     Ratlam          500     mercedes
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus

In [6]:
df.tail()

       Name  Age  Class      Place  Poket Money      vehical
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus
6   Kripalu   28      9     Jaipur           20       CTX100

In [7]:
df.isnull()

    Name    Age  Class  Place  Poket Money  vehical
1  False  False  False  False        False    False
2  False  False  False  False        False    False
3  False  False  False  False        False    False
4  False  False  False  False        False    False
5  False  False  False  False        False    False
6  False  False  False  False        False    False

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 1 to 6
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         6 non-null      object
 1   Age          6 non-null      int64
 2   Class        6 non-null      int64
 3   Place        6 non-null      object
 4   Poket Money  6 non-null      int64
 5   vehical      6 non-null      object
dtypes: int64(3), object(3)
memory usage: 336.0+ bytes

In [9]:
df.describe()

             Age     Class  Poket Money
count   6.000000  6.000000     6.000000
mean   25.500000  6.500000   328.333333
std     1.870829  1.870829   367.718189
min    23.000000  4.000000    20.000000
25%    24.250000  5.250000   112.500000
50%    25.500000  6.500000   175.000000
75%    26.750000  7.750000   425.000000
max    28.000000  9.000000  1000.000000

In [10]:
df.head()

       Name  Age  Class      Place  Poket Money      vehical
1      Ashu   23      4     Ratlam          500     mercedes
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus

In [11]:
df[['Name','Class','Poket Money']]

       Name  Class  Poket Money
1      Ashu      4          500
2   Krishna      5         1000
3  Shashank      6          100
4    Manooj      7          200
5  Karishma      8          150
6   Kripalu      9           20

In [12]:
df[['Poket Money','Name']]

   Poket Money      Name
1          500      Ashu
2         1000   Krishna
3          100  Shashank
4          200    Manooj
5          150  Karishma
6           20   Kripalu

# 2 indexing

row indexing - [loc]

In [13]:
df.loc[['4','5']]

       Name  Age  Class      Place  Poket Money vehical
4    Manooj   26      7  Bhaugarah          200  Scooty
5  Karishma   27      8   Morkheda          150     Bus

3. indexing

iloc - index locating (row & column)

In [14]:
df.head(6)

       Name  Age  Class      Place  Poket Money      vehical
1      Ashu   23      4     Ratlam          500     mercedes
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus
6   Kripalu   28      9     Jaipur           20       CTX100

In [15]:
df.iloc[0:6,0:2]

       Name  Age
1      Ashu   23
2   Krishna   24
3  Shashank   25
4    Manooj   26
5  Karishma   27
6   Kripalu   28

In [16]:
df.iloc[4:5,1:2]

   Age
5   27

In [17]:
df.iloc[1:6,1:2]

   Age
2   24
3   25
4   26
5   27
6   28

In [18]:
df.iloc[0:6,5:]

       vehical
1     mercedes
2  lamborghini
3        Cycle
4       Scooty
5          Bus
6       CTX100

# conver dataframe into arrays

In [19]:
df.iloc[:,1:].values

array([[23, 4, 'Ratlam', 500, 'mercedes'],
       [24, 5, 'Ujjain', 1000, 'lamborghini'],
       [25, 6, 'Mandsaur', 100, 'Cycle'],
       [26, 7, 'Bhaugarah', 200, 'Scooty'],
       [27, 8, 'Morkheda', 150, 'Bus'],
       [28, 9, 'Jaipur', 20, 'CTX100']], dtype=object)

# 3. Basic operations

In [20]:
df.isnull().sum()

Name           0
Age            0
Class          0
Place          0
Poket Money    0
vehical        0
dtype: int64

# To check vlaue count of specific column

In [21]:
df['Age'].value_counts()

Age
23    1
24    1
25    1
26    1
27    1
28    1
Name: count, dtype: int64

In [22]:
df['Age'].unique()

array([23, 24, 25, 26, 27, 28], dtype=int64)

In [23]:
df['Age']>25

1    False
2    False
3    False
4     True
5     True
6     True
Name: Age, dtype: bool

# Series

To create Series in Pandas

In [24]:
pd.__version__

'2.1.4'

In [25]:
list_1 = [1,2,3,6.2,"data values"]
print(list_1)

[1, 2, 3, 6.2, 'data values']

In [28]:
Series_1  = pd.Series(list_1)
print(Series_1)

# or

Series_2 = pd.Series([1,2,3,4,"data_values"])
Series_2

0              1
1              2
2              3
3            6.2
4    data values
dtype: object

0              1
1              2
2              3
3              4
4    data_values
dtype: object

In [27]:
type(Series_1)

pandas.core.series.Series

1.1 Creating Series in short method

In [46]:
data = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\covid_toy.csv",dtype = {'age':'float64'})
data.head()

    age  gender  fever cough     city has_covid
0  60.0    Male  103.0  Mild  Kolkata        No
1  27.0    Male  100.0  Mild    Delhi       Yes
2  42.0    Male  101.0  Mild    Delhi        No
3  31.0  Female   98.0  Mild  Kolkata        No
4  65.0  Female  101.0  Mild   Mumbai        No

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

after changes dtype
"age feature" data type changed from "int64 " to "float64"

In [47]:

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    float64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(2), object(4)
memory usage: 4.8+ KB

In [50]:
df

       Name  Age  Class      Place  Poket Money      vehical
1      Ashu   23      4     Ratlam          500     mercedes
2   Krishna   24      5     Ujjain         1000  lamborghini
3  Shashank   25      6   Mandsaur          100        Cycle
4    Manooj   26      7  Bhaugarah          200       Scooty
5  Karishma   27      8   Morkheda          150          Bus
6   Kripalu   28      9     Jaipur           20       CTX100

# to add columns into dataFrame

In [54]:
import numpy as np
df['Date'] = np.random.choice(['yes', 'no'],size = len(df))
df

       Name  Age  Class      Place  Poket Money      vehical Date
1      Ashu   23      4     Ratlam          500     mercedes  yes
2   Krishna   24      5     Ujjain         1000  lamborghini   no
3  Shashank   25      6   Mandsaur          100        Cycle   no
4    Manooj   26      7  Bhaugarah          200       Scooty   no
5  Karishma   27      8   Morkheda          150          Bus   no
6   Kripalu   28      9     Jaipur           20       CTX100  yes

In [57]:
df['bool'] = (['True', 'False','True', 'False', 'True', 'False'])
df

       Name  Age  Class      Place  Poket Money      vehical Date   bool
1      Ashu   23      4     Ratlam          500     mercedes  yes   True
2   Krishna   24      5     Ujjain         1000  lamborghini   no  False
3  Shashank   25      6   Mandsaur          100        Cycle   no   True
4    Manooj   26      7  Bhaugarah          200       Scooty   no  False
5  Karishma   27      8   Morkheda          150          Bus   no   True
6   Kripalu   28      9     Jaipur           20       CTX100  yes  False

In [69]:
df["Data"] = np.random.choice([1,10],size = len(df))
df

       Name  Age  Class      Place  Poket Money      vehical Date   bool  Data
1      Ashu   23      4     Ratlam          500     mercedes  yes   True     1
2   Krishna   24      5     Ujjain         1000  lamborghini   no  False     1
3  Shashank   25      6   Mandsaur          100        Cycle   no   True     1
4    Manooj   26      7  Bhaugarah          200       Scooty   no  False     1
5  Karishma   27      8   Morkheda          150          Bus   no   True     1
6   Kripalu   28      9     Jaipur           20       CTX100  yes  False    10